"""
ДЗ 1
"""
print ('\n\t\tСЧАСТЬЕ...  \n\nВсе гонятся за чем-то необыкновенным, \nпытаются мечту за хвост поймать, \nа кто-то молится, чтоб снова на мгновенье \nза руку подержать родную мать.\n')
message = 'Кто-то мечтает об этажной яхте, \nкурит сигару, выдыхая ее дым, \nа кто-то, тая на больничной "тАхте", \nне хочет быть усопшим молодым.'
print(message)
print('\nХвастун, объездивший весь свет, \nвам лихо скажет: "Где я только не был!", \nа где-то мальчик девяти от роду лет \nсжимает черствый, но вкуснейший ломтик хлеба.')
print('\nОн для него дороже всех богатств, \nкак час дождя в безжизненной пустыне, \nведь тот, кто своим сердцем не погас, \nдушой не на секунду не остынет!')
print('\nА счастье проще, чем, казалось, может быть. \nВсем разная судьба досталась. \nКто-то на яхте, но не знает куда плыть, \nа кто-то с хлебом, и испытывает радость')
str1 = 'Кравченко'
str2 = 'Дмитрий'
print(f'\nавтор {str1} {str2}')
