# ДЗ 23

# Секретное послание
secret_letter = [['DFВsjl24sfFFяВАДОd24fssflj234'], ['asdfFп234рFFdо24с$#afdFFтasfо'],
['оafбasdf%^о^FFжа$#af243ю'],['afпFsfайFтFsfо13н'],
['fн13Fа1234де123юsdсsfь'], ['чFFтF#Fsfsdf$$о'],
['и$##sfF'], ['вSFSDам'],['пSFоsfнрSDFаSFвSDF$иFFтsfaсSFя'],
['FFэasdfтDFsfоasdfFт'], ['FяDSFзFFsыSfкFFf']]
# Список с маленькими русскими буквами
small_rus = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и',
'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф',
'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']

# Переменная для хранения расшифрованного слова
word = ''
# Цикл для перебора списков
for list_ in secret_letter:
  #Разделяем пробелами слова
  word += ' '
  # Находим индекс символа в списке маленьких русских букв взяв 0й
  for letter in list_[0]:
    if letter in small_rus:
      # Добавляем символ в расшифрованное слово
      word += letter
print(word)
print(word.strip().capitalize())

# Ввод для выхода из программы
input('Для выхода из программы нажмите Enter')